### DataFrames In Pandas
A Pandas DataFrame is a two-dimensional table-like structure in Python where data is arranged in rows and columns. Itâ€™s one of the most commonly used tools for handling data and makes it easy to organize, analyze and manipulate data.

It is Collection of multiple series

In [1]:
import numpy as np 
import pandas as pd

#### Creating DataFrames

In [5]:
# Creating a DataFrame using Dictionary

data = {
    'Name' : ['Atharv' , 'Ayush' , 'Shlok' , 'Atul' , 'Srushti'],
    'Age' : [21 , 15 , 22 , 23 , 24],
    'City' : ['Palava' , 'Thane' , 'Deslepada' , 'Lodha' , 'Sagaon'],
    'Salary' : [10000 , 20000 , 30000 , 40000 , 50000]
}

dictDF = pd.DataFrame(data)
dictDF

      Name  Age       City  Salary
0   Atharv   21     Palava   10000
1    Ayush   15      Thane   20000
2    Shlok   22  Deslepada   30000
3     Atul   23      Lodha   40000
4  Srushti   24     Sagaon   50000

In [ ]:
# Creating a DataFrame using List

l1 = [
    ['Atharv' , 21 , 'Palava' , 10000],
    ['Ayush' , 15 , 'Thane' , 20000],
    ['Shlok' , 22 , 'Deslepada' , 30000],
    ['Atul' , 23 , 'Lodha' , 40000],
    ['Srushti' , 24 , 'Sagaon' , 50000] 
]

col = ['Name' , 'Age' , 'City' , 'Salary']   #In list as we dont have any keys we have to add colums

listDF = pd.DataFrame(l1,columns=col)
listDF

      Name  Age       City  Salary
0   Atharv   21     Palava   10000
1    Ayush   15      Thane   20000
2    Shlok   22  Deslepada   30000
3     Atul   23      Lodha   40000
4  Srushti   24     Sagaon   50000

### Selection and Indexing of Columns

In [13]:
dictDF['Name'] #Target Name column from the dataframe
dictDF[['Age' , 'City']] #Target Name & City from dataframe

   Age       City
0   21     Palava
1   15      Thane
2   22  Deslepada
3   23      Lodha
4   24     Sagaon

### Creating New Column

In [30]:
# Adding one more column in our dataframe
dictDF['Designation'] = ['Engg' , 'Doctor' , 'MD' , 'CA' , 'CA']

In [15]:
dictDF

      Name  Age       City  Salary Designation
0   Atharv   21     Palava   10000        Engg
1    Ayush   15      Thane   20000      Doctor
2    Shlok   22  Deslepada   30000          MD
3     Atul   23      Lodha   40000          CA
4  Srushti   24     Sagaon   50000          CA

### Removing Column

In [16]:
dictDF

      Name  Age       City  Salary Designation
0   Atharv   21     Palava   10000        Engg
1    Ayush   15      Thane   20000      Doctor
2    Shlok   22  Deslepada   30000          MD
3     Atul   23      Lodha   40000          CA
4  Srushti   24     Sagaon   50000          CA

In [ ]:
# Removing designation from the DF

dictDF.drop('Designation' , axis=1 , inplace=True)  #by using inplace it will permanently delete the column

In [34]:
dictDF

      Name  Age       City  Salary
0   Atharv   21     Palava   10000
1    Ayush   15      Thane   20000
2    Shlok   22  Deslepada   30000
3     Atul   23      Lodha   40000
4  Srushti   24     Sagaon   50000

### Selection of rows in DF

In [35]:
dictDF

      Name  Age       City  Salary
0   Atharv   21     Palava   10000
1    Ayush   15      Thane   20000
2    Shlok   22  Deslepada   30000
3     Atul   23      Lodha   40000
4  Srushti   24     Sagaon   50000

In [40]:
# loc / iloc --> location(it is used to select/target the rows in DF)

dictDF.loc[0]  #Selecting sinfle row

dictDF.iloc[[1,2]]  #Selecting multiple rows

    Name  Age       City  Salary
1  Ayush   15      Thane   20000
2  Shlok   22  Deslepada   30000